caoyue12/STM32L151/RUI/Source/nordic/service/lora/app_lora.c
/*
/ _____)             _              | |
( (____  _____ ____ _| |_ _____  ____| |__
\____ \| ___ |    (_   _) ___ |/ ___)  _ \
_____) ) ____| | | || |_| ____( (___| | | |
(______/|_____)_|_|_| \__)_____)\____)_| |_|
(C)2013 Semtech

Description: LoRaMac classA device implementation

License: Revised BSD License, see LICENSE.TXT file include in the project

Maintainer: Miguel Luis and Gregory Cristian
*/

/*! \file classA/SensorNode/main.c */

#include <stdint.h>
#include <string.h>
#include <stddef.h>
#include <math.h>
#include "board_basic.h"
#include "utils.h"
#include "LoRaMac.h"
#include "Region.h"
#include "Commissioning.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_delay.h"
#include "utils.h"
#include "nrf_log_default_backends.h"
#include "nrf_fstorage.h"
#include "app_error.h"
#include "nrf_soc.h"
#include "nrf_sdh.h"
#include "nrf_nvmc.h"

/*!
* Defines the application data transmission duty cycle. 5s, value in [ms].
*/
#define APP_TX_DUTYCYCLE                            20000

/*!
* Defines a random delay for application data transmission duty cycle. 1s,
* value in [ms].
*/
#define APP_TX_DUTYCYCLE_RND                        1000

/*!
* Default datarate
*/
#define LORAWAN_DEFAULT_DATARATE                    DR_0

/*!
* LoRaWAN confirmed messages
*/
#define LORAWAN_CONFIRMED_MSG_ON                    false

/*!
* LoRaWAN Adaptive Data Rate
*
* \remark Please note that when ADR is enabled the end-device should be static
*/
#define LORAWAN_ADR_ON                              1

#if defined( REGION_EU868 )

#include "LoRaMacTest.h"

/*!
* LoRaWAN ETSI duty cycle control enable/disable
*
* \remark Please note that ETSI mandates duty cycled transmissions. Use only for test purposes
*/
#define LORAWAN_DUTYCYCLE_ON                        true

//#define USE_SEMTECH_DEFAULT_CHANNEL_LINEUP          1

#if( USE_SEMTECH_DEFAULT_CHANNEL_LINEUP == 1 )

#define LC4                { 867100000, 0, { ( ( DR_5 << 4 ) | DR_0 ) }, 0 }
#define LC5                { 867300000, 0, { ( ( DR_5 << 4 ) | DR_0 ) }, 0 }
#define LC6                { 867500000, 0, { ( ( DR_5 << 4 ) | DR_0 ) }, 0 }
#define LC7                { 867700000, 0, { ( ( DR_5 << 4 ) | DR_0 ) }, 0 }
#define LC8                { 867900000, 0, { ( ( DR_5 << 4 ) | DR_0 ) }, 0 }
#define LC9                { 868800000, 0, { ( ( DR_7 << 4 ) | DR_7 ) }, 2 }
#define LC10               { 868300000, 0, { ( ( DR_6 << 4 ) | DR_6 ) }, 1 }

#endif

#endif

/*!
* LoRaWAN application port
*/
#define LORAWAN_APP_PORT                            2

/*!
* User application data buffer size
*/
#if defined( REGION_CN470 ) || defined( REGION_CN779 ) || defined( REGION_EU433 ) || defined( REGION_EU868 ) || defined( REGION_IN865 ) || defined( REGION_KR920 )

#define LORAWAN_APP_DATA_SIZE                       16

#elif defined( REGION_AS923 ) || defined( REGION_AU915 ) || defined( REGION_US915 ) || defined( REGION_US915_HYBRID )

#define LORAWAN_APP_DATA_SIZE                       11

#else

#error "Please define a region in the compiler options."

#endif

static uint8_t DevEui[] = LORAWAN_DEVICE_EUI;
static uint8_t AppEui[] = LORAWAN_APPLICATION_EUI;
static uint8_t AppKey[] = LORAWAN_APPLICATION_KEY;

#if( OVER_THE_AIR_ACTIVATION == 0 )

static uint8_t NwkSKey[] = LORAWAN_NWKSKEY;
static uint8_t AppSKey[] = LORAWAN_APPSKEY;

/*!
* Device address
*/
static uint32_t DevAddr = LORAWAN_DEVICE_ADDRESS;

#endif

/*!
* Application port
*/
static uint8_t AppPort = LORAWAN_APP_PORT;

/*!
* User application data size
*/
static uint8_t AppDataSize = LORAWAN_APP_DATA_SIZE;

/*!
* User application data buffer size
*/
#define LORAWAN_APP_DATA_MAX_SIZE                           100

/*!
* User application data
*/
static uint8_t AppData[LORAWAN_APP_DATA_MAX_SIZE];


/*!
* Indicates if the node is sending confirmed or unconfirmed messages
*/
static uint8_t IsTxConfirmed = LORAWAN_CONFIRMED_MSG_ON;

/*!
* Defines the application data transmission duty cycle
*/
static uint32_t TxDutyCycleTime;

/*!
* Timer to handle the application data transmission duty cycle
*/
static TimerEvent_t TxNextPacketTimer;

/*!
* Specifies the state of the application LED
*/
static bool AppLedStateOn = false;


/*!
* Indicates if a new packet can be sent
*/
static bool NextTx = true;


extern void cli_init(void);
extern void cli_start(void);
extern void cli_process(void);
extern uint8_t JOIN_FLAG;
void reset_handle(void);

/*!
* Device states
*/
static enum eDeviceState
{
    DEVICE_STATE_INIT,
    DEVICE_STATE_JOIN,
    DEVICE_STATE_SEND,
    DEVICE_STATE_CYCLE,
    DEVICE_STATE_SLEEP
}DeviceState;

/*!
* LoRaWAN compliance tests support data
*/
struct ComplianceTest_s
{
    bool Running;
    uint8_t State;
    bool IsTxConfirmed;
    uint8_t AppPort;
    uint8_t AppDataSize;
    uint8_t *AppDataBuffer;
    uint16_t DownLinkCounter;
    bool LinkCheck;
    uint8_t DemodMargin;
    uint8_t NbGateways;
}ComplianceTest;



lora_cfg_t g_lora_cfg_t;

uint32_t LORA_CONFIG_START_ADDRESS = 0x0007F000;

void read_lora_config(void)
{
       memcpy(&g_lora_cfg_t,LORA_CONFIG_START_ADDRESS,sizeof(g_lora_cfg_t));
       memcpy(DevEui,g_lora_cfg_t.dev_eui,sizeof(DevEui));
       memcpy(AppEui,g_lora_cfg_t.app_eui,sizeof(AppEui));
       memcpy(AppKey,g_lora_cfg_t.app_key,sizeof(AppKey)); 
#if( OVER_THE_AIR_ACTIVATION == 0 )

       memcpy(NwkSKey,g_lora_cfg_t.nwkskey,sizeof(NwkSKey));    
       memcpy(AppSKey,g_lora_cfg_t.appskey,sizeof(AppSKey));
       memcpy(DevAddr,g_lora_cfg_t.dev_addr,sizeof(DevAddr));     
 #endif
}

void write_lora_config(void)
{
    nrf_sdh_disable_request();
    delay_ms(10);
    nrf_nvmc_page_erase(LORA_CONFIG_START_ADDRESS);
    delay_ms(100);
    nrf_nvmc_write_bytes(LORA_CONFIG_START_ADDRESS,(uint8_t*)&g_lora_cfg_t,sizeof(g_lora_cfg_t));
    delay_ms(100);
    reset_handle();
}

void dump_hex2str(uint8_t *buf , uint8_t len)
{
    uint8_t str[56] = {};
    
    for(uint8_t i=0; i<len; i++) {
        sprintf(str+i*2,"%02X",buf[i]);
    }
    NRF_LOG_INFO("%s\r\n",str);
}

int set_handler(int argc, char* argv[], lora_cfg_t* cfg_info)
{
    
