caoyue12/STM32L151/RUI/Source/nordic/service/lora/app_lora.c
    NRF_LOG_INFO("%s=%s", argv[0], argv[1]);
    
    if (strcmp(argv[0], "dev_eui") == 0) {
        StrToHex((char *)cfg_info->dev_eui, argv[1], 8);
    }
    else if (strcmp(argv[0], "app_eui") == 0) {
        StrToHex((char *)cfg_info->app_eui, argv[1], 8);
    }
    else if (strcmp(argv[0], "app_key") == 0) {
        StrToHex((char *)cfg_info->app_key, argv[1], 16);
    }
    else if (strcmp(argv[0], "dev_addr") == 0) {
        cfg_info->dev_addr = strtoul(argv[1], NULL, 16);
    }
    else if (strcmp(argv[0], "nwkskey") == 0) {
        StrToHex((char *)cfg_info->nwkskey, argv[1], 16);
    }
    else if (strcmp(argv[0], "appskey") == 0) {
        StrToHex((char *)cfg_info->appskey, argv[1], 16);
    }
    else
    {
        return -1;  
    }
    return 0;
}

int  parse_lora_config(char* str, lora_cfg_t *cfg)
{
    int argc;
    char* buf, *temp;
    char* argv[10];
    uint8_t flag = 1;
    
    do{
        argc = 0;
        if ((temp = strchr(str, '&')) != NULL) {
            *temp = '\0';
        }
        else
            flag = 0;
        
        if ((buf = strchr(str, '=')) != NULL) {
            argv[0] = str;
            if (*(buf + 1) == '\0')
                argc = 1;
            else {
                argc = 2;
                argv[1] = buf + 1;
            }
            *buf = '\0';
        }
        else {
            NRF_LOG_INFO("err\r\n");
            return -1;
        }
        if (argc > 0) {  
            if (set_handler(argc, argv, cfg) != 0) {
                return -1;
            }
        }
        else {
            return -1;
        }
        str = ++temp;
        
    } while(flag); 
    
    return 0;
}

static void PrepareTxFrame( uint8_t port )
{
    switch( port )
    {
      case 2:
        {
            //AppDataSize = strlen(AppData);
        }
      case 224:
        if( ComplianceTest.LinkCheck == true )
        {
            ComplianceTest.LinkCheck = false;
            AppDataSize = 3;
            AppData[0] = 5;
            AppData[1] = ComplianceTest.DemodMargin;
            AppData[2] = ComplianceTest.NbGateways;
            ComplianceTest.State = 1;
        }
        else
        {
            switch( ComplianceTest.State )
            {
              case 4:
                ComplianceTest.State = 1;
                break;
              case 1:
                AppDataSize = 2;
                AppData[0] = ComplianceTest.DownLinkCounter >> 8;
                AppData[1] = ComplianceTest.DownLinkCounter;
                break;
            }
        }
        break;
      default:
        break;
    }
}

/*!
* \brief   Prepares the payload of the frame
*
* \retval  [0: frame could be send, 1: error]
*/
static bool SendFrame( void )
{
    McpsReq_t mcpsReq;
    LoRaMacTxInfo_t txInfo;
    
    if( LoRaMacQueryTxPossible( AppDataSize, &txInfo ) != LORAMAC_STATUS_OK )
    {
        // Send empty frame in order to flush MAC commands
        mcpsReq.Type = MCPS_UNCONFIRMED;
        mcpsReq.Req.Unconfirmed.fBuffer = NULL;
        mcpsReq.Req.Unconfirmed.fBufferSize = 0;
        mcpsReq.Req.Unconfirmed.Datarate = LORAWAN_DEFAULT_DATARATE;
    }
    else
    {
        if( IsTxConfirmed == false )
        {
            mcpsReq.Type = MCPS_UNCONFIRMED;
            mcpsReq.Req.Unconfirmed.fPort = AppPort;
            mcpsReq.Req.Unconfirmed.fBuffer = AppData;
            mcpsReq.Req.Unconfirmed.fBufferSize = AppDataSize;
            mcpsReq.Req.Unconfirmed.Datarate = LORAWAN_DEFAULT_DATARATE;
        }
        else
        {
            mcpsReq.Type = MCPS_CONFIRMED;
            mcpsReq.Req.Confirmed.fPort = AppPort;
            mcpsReq.Req.Confirmed.fBuffer = AppData;
            mcpsReq.Req.Confirmed.fBufferSize = AppDataSize;
            mcpsReq.Req.Confirmed.NbTrials = 8;
            mcpsReq.Req.Confirmed.Datarate = LORAWAN_DEFAULT_DATARATE;
        }
    }
    
    if( LoRaMacMcpsRequest( &mcpsReq ) == LORAMAC_STATUS_OK )
    {
        return false;
    }
    return true;
}

/*!
* \brief Function executed on TxNextPacket Timeout event
*/
static void OnTxNextPacketTimerEvent( void )
{
#if 1
    MibRequestConfirm_t mibReq;
    LoRaMacStatus_t status;
    
    TimerStop( &TxNextPacketTimer );
    
    mibReq.Type = MIB_NETWORK_JOINED;
    status = LoRaMacMibGetRequestConfirm( &mibReq );

    if( status == LORAMAC_STATUS_OK )
    {
        if( mibReq.Param.IsNetworkJoined == true )
        {
            DeviceState = DEVICE_STATE_SEND;
            NextTx = true;
        }
        else
        {
            DeviceState = DEVICE_STATE_JOIN;
        }
    }
#endif
}


/*!
* \brief   MCPS-Confirm event function
*
* \param   [IN] mcpsConfirm - Pointer to the confirm structure,
*               containing confirm attributes.
*/
static void McpsConfirm( McpsConfirm_t *mcpsConfirm )
{
    if( mcpsConfirm->Status == LORAMAC_EVENT_INFO_STATUS_OK )
    {
        switch( mcpsConfirm->McpsRequest )
        {
          case MCPS_UNCONFIRMED:
            {
                // Check Datarate
                // Check TxPower
                break;
            }
          case MCPS_CONFIRMED:
            {
                // Check Datarate
                // Check TxPower
                // Check AckReceived
                // Check NbTrials
                break;
            }
          case MCPS_PROPRIETARY:
            {
                break;
            }
          default:
            break;
        }
        
    }
    NextTx = true;
}

/*!
* \brief   MCPS-Indication event function
*
* \param   [IN] mcpsIndication - Pointer to the indication structure,
*               containing indication attributes.
*/
static void McpsIndication( McpsIndication_t *mcpsIndication )
{
    if( mcpsIndication->Status != LORAMAC_EVENT_INFO_STATUS_OK )
    {
        return;
    }
    
    switch( mcpsIndication->McpsIndication )
    {
      case MCPS_UNCONFIRMED:
        {
            break;
        }
      case MCPS_CONFIRMED:
        {
            break;
        }
      case MCPS_PROPRIETARY:
        {
            break;
        }
      case MCPS_MULTICAST:
        {
            break;
        }
      default:
        break;
    }
    
    // Check Multicast
    // Check Port
    // Check Datarate
    // Check FramePending
    // Check Buffer
    // Check BufferSize
    // Check Rssi
    // Check Snr
    // Check RxSlot
    
    if( ComplianceTest.Running == true )
    {
        ComplianceTest.DownLinkCounter++;
    }
    
    if( mcpsIndication->RxData == true )
    {
        switch( mcpsIndication->Port )
        {
          case 1: // The application LED can be controlled on port 1 or 2
          case 2:
            if( mcpsIndication->BufferSize == 1 )
            {
                AppLedStateOn = mcpsIndication->Buffer[0] & 0x01;
            }
            break;
          case 224:
            if( ComplianceTest.Running == false )
            {
                // Check compliance test enable command (i)
                if( ( mcpsIndication->BufferSize == 4 ) &&
                   ( mcpsIndication->Buffer[0] == 0x01 ) &&
                       ( mcpsIndication->Buffer[1] == 0x01 ) &&
                           ( mcpsIndication->Buffer[2] == 0x01 ) &&
                               ( mcpsIndication->Buffer[3] == 0x01 ) )
                {
                    IsTxConfirmed = false;
                    AppPort = 224;
                    AppDataSize = 2;
                    ComplianceTest.DownLinkCounter = 0;
                    ComplianceTest.LinkCheck = false;
                    ComplianceTest.DemodMargin = 0;
                    ComplianceTest.NbGateways = 0;
                    ComplianceTest.Running = true;
                    ComplianceTest.State = 1;
                    
