caoyue12/STM32L151/RUI/Source/nordic/service/lora/app_lora.c
LoRaMacPrimitives_t LoRaMacPrimitives;
LoRaMacCallback_t LoRaMacCallbacks;
MibRequestConfirm_t mibReq;




void region_init()
{
	     LoRaMacPrimitives.MacMcpsConfirm = McpsConfirm;
            LoRaMacPrimitives.MacMcpsIndication = McpsIndication;
            LoRaMacPrimitives.MacMlmeConfirm = MlmeConfirm;
            LoRaMacCallbacks.GetBatteryLevel = BoardGetBatteryLevel;
#if defined( REGION_AS923 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_AS923 );
#elif defined( REGION_AU915 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_AU915 );
#elif defined( REGION_CN470 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_CN470 );
#elif defined( REGION_CN779 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_CN779 );
#elif defined( REGION_EU433 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_EU433 );
#elif defined( REGION_EU868 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_EU868 );
#elif defined( REGION_IN865 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_IN865 );
#elif defined( REGION_KR920 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_KR920 );
#elif defined( REGION_US915 )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_US915 );
#elif defined( REGION_US915_HYBRID )
            LoRaMacInitialization( &LoRaMacPrimitives, &LoRaMacCallbacks, LORAMAC_REGION_US915_HYBRID );
#else
#error "Please define a region in the compiler options."
#endif
            //TimerInit( &TxNextPacketTimer, OnTxNextPacketTimerEvent );
            
            //TimerInit( &Led1Timer, OnLed1TimerEvent );
            //TimerSetValue( &Led1Timer, 2000 );   
            
            mibReq.Type = MIB_ADR;
            mibReq.Param.AdrEnable = LORAWAN_ADR_ON;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
            mibReq.Type = MIB_PUBLIC_NETWORK;
            mibReq.Param.EnablePublicNetwork = LORAWAN_PUBLIC_NETWORK;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
            //DeviceState = DEVICE_STATE_JOIN;
            NRF_LOG_INFO("goto to join");
#if( OVER_THE_AIR_ACTIVATION != 0 )
            MlmeReq_t mlmeReq;
            
            // Initialize LoRaMac device unique ID
            //BoardGetUniqueId( DevEui );
            
            NRF_LOG_INFO("OTAA: \r\n");
            NRF_LOG_INFO("Dev_EUI:");
            dump_hex2str(DevEui, 8);
            NRF_LOG_INFO("AppEui:");
            dump_hex2str(AppEui , 8);
            NRF_LOG_INFO("AppKey:");
            dump_hex2str(AppKey , 16);
            
            mlmeReq.Type = MLME_JOIN;
            
            mlmeReq.Req.Join.DevEui = DevEui;
            mlmeReq.Req.Join.AppEui = AppEui;
            mlmeReq.Req.Join.AppKey = AppKey;
            mlmeReq.Req.Join.NbTrials = 3;
            
#if defined ( REGION_US915 )  
            
            uint16_t ch_mask[5];
            ch_mask[0] =0xff00;
            ch_mask[1] =0x0000;
            ch_mask[2] =0x0000;
            ch_mask[3] =0x0000;
            ch_mask[4] =0x0000;
            
            mibReq.Type = MIB_CHANNELS_DEFAULT_MASK;  
            mibReq.Param.ChannelsDefaultMask = ch_mask;
            LoRaMacMibSetRequestConfirm( &mibReq ); 
            
            mibReq.Type = MIB_CHANNELS_MASK;  
            mibReq.Param.ChannelsDefaultMask = ch_mask;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
#endif            
            if( NextTx == true )
            {
                LoRaMacStatus_t status;
                status = LoRaMacMlmeRequest( &mlmeReq );
                NRF_LOG_INFO("OTAA Join Start...%d \r\n", status);
            }
            //DeviceState = DEVICE_STATE_SLEEP;
            NRF_LOG_INFO("goto to sleep");
#else
            // Choose a random device address if not already defined in Commissioning.h
            if( DevAddr == 0 )
            {
                // Random seed initialization
                srand1( BoardGetRandomSeed( ) );
                
                // Choose a random device address
                DevAddr = randr( 0, 0x01FFFFFF );
            }
            
            NRF_LOG_INFO("ABP: \r\n");
            NRF_LOG_INFO("Dev_EUI: ");
            dump_hex2str(DevEui , 8);
            NRF_LOG_INFO("DevAddr: %08X\r\n", DevAddr);
            NRF_LOG_INFO("NwkSKey: ");
            dump_hex2str(NwkSKey , 16);
            NRF_LOG_INFO("AppSKey: ");
            dump_hex2str(AppSKey , 16);
            
            mibReq.Type = MIB_NET_ID;
            mibReq.Param.NetID = LORAWAN_NETWORK_ID;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
            mibReq.Type = MIB_DEV_ADDR;
            mibReq.Param.DevAddr = DevAddr;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
            mibReq.Type = MIB_NWK_SKEY;
            mibReq.Param.NwkSKey = NwkSKey;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
            mibReq.Type = MIB_APP_SKEY;
            mibReq.Param.AppSKey = AppSKey;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
            mibReq.Type = MIB_NETWORK_JOINED;
            mibReq.Param.IsNetworkJoined = true;
            LoRaMacMibSetRequestConfirm( &mibReq );
            
            //DeviceState = DEVICE_STATE_SEND;
#endif
            
}
void app_send()
{
     PrepareTxFrame( 2 );
     NextTx = SendFrame( );
}

uint32_t lora_send(uint8_t *cmd)
{
      uint32_t len = 0;
      memset(AppData,0,LORAWAN_APP_DATA_MAX_SIZE);
      len = sprintf(AppData, "%s", cmd);
      memcpy(AppData,cmd,len);
      AppDataSize = len;
      NRF_LOG_INFO("lora_send len = %d\r\n",len);
      MibRequestConfirm_t mibReq;
      LoRaMacStatus_t status;
      
      mibReq.Type = MIB_NETWORK_JOINED;
      status = LoRaMacMibGetRequestConfirm( &mibReq );
      
      if( status == LORAMAC_STATUS_OK )
      {
          if( mibReq.Param.IsNetworkJoined == true )
          {
              app_send();
          }
      }
      return SUCCESS;
}

Gpio_t ioreset;
GpioIrqHandler *callback;
void reset_handle(void)
{
    NRF_LOG_INFO("Reset!!!\r\n");
    NVIC_SystemReset();
}

void lora_init()
{
    ret_code_t err_code;
    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);
    SX1276IoInit( );
    callback = reset_handle;
    GpioInit(&ioreset,RESET_PIN ,PIN_INPUT,PIN_PUSH_PULL,PIN_PULL_UP,1 );
    GpioSetInterrupt(&ioreset,IRQ_FALLING_EDGE,IRQ_HIGH_PRIORITY,callback);
    rak_uart_init(LOG_USE_UART,UART_RXD_PIN,UART_TXD_PIN,UART_BAUDRATE_BAUDRATE_Baud115200);
    read_lora_config();
}







